Autodesk.Revit.DB.KeyBasedTreeEntries.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.KeyBasedTreeEntries.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator
Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Returns:
A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntries.FindEntry(System.String)
Finds the KeyBasedTreeEntry associated with the given key value.
Remarks:
If no matching KeyBasedTreeEntry can be found, null will be returned;
The given key value cannot be an empty string.
key:
The specified key value.
Returns:
The KeyBasedTreeEntry corresponds to the given key value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntries.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.KeyBasedTreeEntries
A collection of KeyBasedTreeEntry objects that make up the key-based tree.
Since:
2015